xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxMtu_bf.h
/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.ERAY_OBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_OBF0_DONE_OFF (2u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.ERAY_TBF_IBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_TBF_IBF0_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.ERAY_TBF_IBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_TBF_IBF0_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.ERAY_TBF_IBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_TBF_IBF0_DONE_OFF (4u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.ERAY_MBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_MBF0_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.ERAY_MBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_MBF0_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.ERAY_MBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_MBF0_DONE_OFF (6u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.SCR_XRAM_DONE */
#define IFX_MTU_MEMDONE2_SCR_XRAM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.SCR_XRAM_DONE */
#define IFX_MTU_MEMDONE2_SCR_XRAM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.SCR_XRAM_DONE */
#define IFX_MTU_MEMDONE2_SCR_XRAM_DONE_OFF (13u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.SCR_RAMINT_DONE */
#define IFX_MTU_MEMDONE2_SCR_RAMINT_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.SCR_RAMINT_DONE */
#define IFX_MTU_MEMDONE2_SCR_RAMINT_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.SCR_RAMINT_DONE */
#define IFX_MTU_MEMDONE2_SCR_RAMINT_DONE_OFF (14u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.GIGETH_RX_DONE */
#define IFX_MTU_MEMDONE2_GIGETH_RX_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.GIGETH_RX_DONE */
#define IFX_MTU_MEMDONE2_GIGETH_RX_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.GIGETH_RX_DONE */
#define IFX_MTU_MEMDONE2_GIGETH_RX_DONE_OFF (18u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.GIGETH_TX_DONE */
#define IFX_MTU_MEMDONE2_GIGETH_TX_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.GIGETH_TX_DONE */
#define IFX_MTU_MEMDONE2_GIGETH_TX_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.GIGETH_TX_DONE */
#define IFX_MTU_MEMDONE2_GIGETH_TX_DONE_OFF (19u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU0_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU0_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU0_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DMEM_FDA_OFF (0u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU0_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU0_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU0_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DTAG_FDA_OFF (1u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU0_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU0_PMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU0_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU0_PMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU0_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU0_PMEM_FDA_OFF (2u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU0_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU0_PTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU0_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU0_PTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU0_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU0_PTAG_FDA_OFF (3u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU0_DLMU_STBY_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DLMU_STBY_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU0_DLMU_STBY_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DLMU_STBY_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU0_DLMU_STBY_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DLMU_STBY_FDA_OFF (4u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU1_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU1_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU1_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DMEM_FDA_OFF (5u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU1_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU1_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU1_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DTAG_FDA_OFF (6u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU1_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU1_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU1_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PMEM_FDA_OFF (7u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU1_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU1_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU1_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PTAG_FDA_OFF (8u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU1_DLMU_STBY_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DLMU_STBY_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU1_DLMU_STBY_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DLMU_STBY_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU1_DLMU_STBY_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DLMU_STBY_FDA_OFF (9u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.CPU0_DMEM1_FDA */
#define IFX_MTU_MEMFDA1_CPU0_DMEM1_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.CPU0_DMEM1_FDA */
#define IFX_MTU_MEMFDA1_CPU0_DMEM1_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.CPU0_DMEM1_FDA */
#define IFX_MTU_MEMFDA1_CPU0_DMEM1_FDA_OFF (2u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.CPU1_DMEM1_FDA */
#define IFX_MTU_MEMFDA1_CPU1_DMEM1_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.CPU1_DMEM1_FDA */
#define IFX_MTU_MEMFDA1_CPU1_DMEM1_FDA_MSK (0x1u)

